[
    {
        "text": "I didn’t get rejected from a company.\nI got rejected by 57 companies.\n\nNot in one year.\nIn a single day.\n\nSome never replied.\nSome ghosted after 5 rounds.\nSome said, ‘We’re looking for someone with more stability.’\nSome just stopped posting the job after interviews.\n\nAt first, I thought: Maybe I’m not good enough.\nBut then I realized - this wasn’t a reflection of my skills.\nIt was a reflection of a broken hiring system.\n\nBecause talent doesn’t vanish with one rejection.\nPotential doesn’t expire because of HR silence.\nAnd your worth is not defined by an ATS filter.\n\nTo anyone struggling right now -\nYour rejection letter is not the final word.\nIt’s just a detour.\n\nOne ‘YES’ is enough to erase 100 ‘NOs.’\nOne door can change your whole life.\n\nAnd when that door opens -\nYou’ll look back and thank every single rejection that didn’t work out.\n\nBecause rejections don’t break you.\nThey build you.",
        "engagement": 79,
        "line_count": 24,
        "language": "English",
        "tags": [
            "Rejection",
            "Motivation"
        ]
    },
    {
        "text": "The Real Reason People Quit -\n\nIt’s rarely just about money.\nIt’s about:\n\nFeeling invisible in meetings.\n\nNever hearing a ‘thank you.’\n\nBeing treated like a resource instead of a person.\n\nWe think attrition is solved with better pay and perks.\nBut sometimes, it’s solved by basic human decency.",
        "engagement": 216,
        "line_count": 8,
        "language": "English",
        "tags": [
            "Career",
            "Human Resources"
        ]
    },
    {
        "text": "A recent survey found that 68% of job seekers applied to roles that were never actively hiring.\n\nAnother report revealed that over 40% of job postings online are ‘ghost jobs.’\n\nWhy do companies do this?\n\nTo look like they are growing (good for investors).\n\nTo build a candidate pipeline they’ll never call.\n\nTo make employees think ‘we are hiring, so business is great.’\n\nSometimes just to collect free resumes for future reference.\n\nBut the impact?\n\n70% of candidates report feeling ‘demotivated’ when they realize the job was never real.\n\nPeople waste hours applying, editing resumes, and preparing for nothing.\n\nIt worsens the already fragile mental health of job seekers.\n\nGhost hiring isn’t just unethical - it’s cruel.\nWhen hope is given without intention, it becomes exploitation.\n\nIf you’ve ever refreshed your inbox waiting for a reply that never comes - you’re not alone.\n\nAnd if you’re a company doing this? Remember: reputation is harder to rebuild than a candidate pipeline.\n\nJob seekers deserve honesty. Not illusions",
        "engagement": 178,
        "line_count": 17,
        "language": "English",
        "tags": [
            "Rejection",
            "Job Search"
        ]
    },
    {
        "text": "You earn ₹1,00,000 a month.\n\nBut spend ₹60,000 on therapy, medicines, and stress relief.\n\nThat’s not income.\nThat’s recovery cost.\n\nChoose wisely.",
        "engagement": 74,
        "line_count": 5,
        "language": "Hinglish",
        "tags": [
            "Career",
            "Mental Health"
        ]
    },
    {
        "text": "What's up with AI Interviews?\n\nGot a call from 'Laura'\n\nShe began explaining about the company, role and then said that she will take my screening round.\n\nShe asked me - ' how are you doing?'\n\nI was so done at that time - I said 'Honestly, not good. Life has been off the tracks lately, feeling overwhelmed....'\n\nThe response she gave me was - 'OOH THAT IS AWESOME!'\n\nDear companies, if you’re going to use AI → at least train it to understand the difference between depression and Disneyland.\n\nPlease use AI for making your process easier - I am all in for that but have some basic training done at least.\n\nHiring is not just about efficiency.\nIt’s about connection.\nIt’s about understanding the person in front of you.\n\nAnd please, please, please – don’t lose the human touch in Human Resources.",
        "engagement": 312,
        "line_count": 17,
        "language": "English",
        "tags": [
            "Job Search",
            "Human Resources"
        ]
    },
    {
        "text": "I want to talk about HRs today.\n\nI have met the extreme ends of HRs that are possible during my professional journey.\n\nSome of them are my legit besties - I talk with them every week, they help me through thick and thin. Beautiful by heart - deeply care about everyone.\n\nWhen I talk to them - they actually care about candidates - I remember having a conversation with 1 of my friends and he was sad because the other HR in his team did not close the job posting even after hiring someone and he fought with him and took it to upper management. Man of values :)\n\nI appreciate the values that they hold!\n\nThen I met the other kind of HR -\n\nOoh, my worst nightmare.\n\nThe ones who…\n\nRead employees’ private chats when laptops were returned after resignation.\n\nTreated colleagues like ‘personal assistants.’\n\nSpread gossip about people’s bodies and personal lives.\n\nTook credit for others’ work but never lifted a finger when it came to responsibility.\n\nEveryone I knew in that company had some complaints about that person.\n\nI’ve seen employees cry because of them.\n\nI’ve seen careers stall because of their politics.\n\nI’ve seen people lose respect for the HR role itself - just because of a few rotten apples.\n\nSo yes, HRs are not all the same.\n\nSome of them become your strongest support system.\n\nSome of them become your worst nightmare.\n\nBut here’s my request:\nDon’t mock the entire profession. Appreciate the good ones.\n\nBecause the right HR can change your career.\nThe wrong one can ruin your mental health.\n\nSo, next time you think of HR - don’t just remember the bad stories.\n\nRemember the ones who quietly fight for you behind the scenes too!",
        "engagement": 1225,
        "line_count": 41,
        "language": "English",
        "tags": [
            "Career",
            "Human Resources"
        ]
    },
    {
        "text": "I just wish job calls came in as frequently as loan approval calls.\n\nRight now:\nLoans – Approved\nJobs – Application under review since 1999\n\nBhai Bajaj Finance Loan Serv bass kardo? People wake up with 'Good morning' texts from their partners - I wake up with your phone calls\n\nDear Universe,\nStop approving loans I never asked for.\nApprove the jobs I actually applied for.",
        "engagement": 290,
        "line_count": 9,
        "language": "Hinglish",
        "tags": [
            "Job Search",
            "Rejection"
        ]
    },
    {
        "text": "Respect.\nA word we all use, but don’t always mean the same way.\n\nFor some, respect means treating someone like a human being.\nFor others, respect means treating someone like an authority.\n\nThe real issue?\nWhen people in power say:\n‘If you don’t respect me, I won’t respect you.’\n\nBut what they actually mean is:\n‘If you don’t treat me like an authority, I won’t treat you like a person.’\n\nAnd that’s dangerous.\nBecause everyone deserves to be treated like a person - no matter their title, position, or power.\n\nRespect should never be conditional on hierarchy.\nIt should be the bare minimum of humanity.",
        "engagement": 129,
        "line_count": 11,
        "language": "English",
        "tags": [
            "Motivation"
        ]
    },
    {
        "text": "Danish Bhai agar aaj zinda hote toh -\n\nUnnko bhi job nahi milti.\n\nJust a reminder – Market is bad. Sometimes it’s not your fault.\n\nYou are not underqualified. You are not lazy. You are not ‘less deserving.’\n\nIt’s just the timing.\nHang in there. Your break will come.\n\nUntil then –\nNetwork karo.\nUpskill karo.\nAur apna mental health mat bigadna.\n\nJob market tough hai, but tum usse bhi zyada tough ho.\n\nDanish Bhai ki kasam...",
        "engagement": 209,
        "line_count": 12,
        "language": "Hinglish",
        "tags": [
            "Job Search",
            "Motivation"
        ]
    },
    {
        "text": "Advice to everyone who have a lot of people doubting their potential -\n\nJabb chaar log kuch kahe,\njust become behra.\n\nThat's the only way to\nMaintain a smile on your chehra.\n\nThank you!\n\nWill come back with more advice",
        "engagement": 116,
        "line_count": 7,
        "language": "Hinglish",
        "tags": [
            "Motivation"
        ]
    },
    {
        "text": "Professional Life Lessons -\n\nYour resume gets you shortlisted.\nYour attitude gets you selected.\nYour mental health keeps you there.\n\nDo you agree?",
        "engagement": 80,
        "line_count": 4,
        "language": "English",
        "tags": [
            "Mental Health",
            "Motivation"
        ]
    },
    {
        "text": "Linkedin is getting wilder day by day -\n\nSome people are calling out their friend here - (Paisa waapis karde 3 saal ho gaye)\n\nSome people are calling out their boyfriend - (you used me and now threw me)\n\nSome people are busy flirting in comments - (I got this comment on my post - 'I love you more than your posts')\n\nSome people are posting thirst traps XD\n\nSome people are posting wedding photos with the caption – ‘Biggest collaboration of my life’\n\nSome people are showing off their vacation – ‘Even from Maldives, I’m available for client calls’\n\nIf you have not seen either of these posts - consider yourself blessed.\n\nMy feed is totally broken.",
        "engagement": 335,
        "line_count": 11,
        "language": "Hinglish",
        "tags": [
            "Social Media"
        ]
    }
]